app/views/mangas/index.html.haml

SELECT COUNT(*) FROM `mangas`
---
-#   pag:
-#   - Manga.lpages.each do |i|