app/controllers/chapters_controller.rb

  def show
    @chapter = first_named Chapter
    return not_found if @chapter.nil?
    @manga = @chapter.manga
    @pages = @chapter.pages
    @chapters = @manga.chapters
    @page = params[:page].blank? ? @pages.first : @pages[params[:page].to_i]
---
SELECT COUNT(*) FROM `pages` WHERE `chapter_id` = 1