app/controllers/mangas_controller.rb

SELECT COUNT(*) FROM `mangas`
---
  def index
    @mangas = if params[:lpage]
      lpage = Manga.lpages.index params[:lpage]
      Manga.all(published: true, letter_idx: lpage)